Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetAllObjects Method
 Returns an enumerator of all the model objects in the current model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetAllObjects()
Public Function GetAllObjects As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator of all the model objects.
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model Namespace